In [1]:
import pandas as pd
import numpy as np

Pandas provide two type. of data structures **series and data frame**

# series

### pandas.Series(data=None, index=None, dtype=None, name=None, copy=None, fastpath=_NoDefault.no_default)

Pandas is a popular library in Python for data manipulation and analysis. It provides a data structure called Series, which is a one-dimensional labeled array capable of holding any data type. You can think of a Series as a column in a spreadsheet or a single column of data.

### syntax to create a series:
- class pandas.Series(data=None, index=None, dtype=None, name=None, copy=None)
- Setting copy=True in the pandas.Series constructor will create a copy of the data passed to it
- Only affects Series or 1d ndarray input. See examples.

In [2]:
data = np.array(['a', 'b', 'c', 'd', 'e', 'f'])
sr = pd.Series(data)

In [3]:
sr

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [4]:
index = [9, 8, 7, 6, 5, 4]
sr = pd.Series(data, index)
sr

9    a
8    b
7    c
6    d
5    e
4    f
dtype: object

In [5]:
sr[6] = 'k'
sr

9    a
8    b
7    c
6    k
5    e
4    f
dtype: object

In [6]:
data #even though the series changed and our copy was false but our data didnt change this happened e=because
# This is because the dtype of a ('<U6' in your example) and the dtype passed as argument ("object") to np.asarray don't match. You can verify that the Series is being backed by a copy and not the original array by
# due tp that series will always make copy to solve this problem we can give specifically a dtype = object to our array

array(['a', 'b', 'c', 'd', 'e', 'f'], dtype='<U1')

In [7]:
data2 = np.array(['a', 'b', 'c', 'd', 'e', 'f'], dtype = object)
sr2 = pd.Series(data2)
sr2[3] = 'k'
data2

array(['a', 'b', 'c', 'k', 'e', 'f'], dtype=object)

In [8]:
# copy and name in series, asigning a name will show up when chcking info and when printing
sr = pd.Series(data, index, copy = False, name = 'example')

In [9]:
print(sr)

9    a
8    b
7    c
6    d
5    e
4    f
Name: example, dtype: object

In [10]:
sr[6] = 'k'

In [11]:
data2

array(['a', 'b', 'c', 'k', 'e', 'f'], dtype=object)

In [12]:
sr.info

<bound method Series.info of 9    a
8    b
7    c
6    k
5    e
4    f
Name: example, dtype: object>

In [13]:
d2 = np.array([1,2,3,4,5,6])
s2 = pd.Series(d2)
s2[4] = 234 # data changes with change in series

In [14]:
d2

array([  1,   2,   3,   4, 234,   6])

In [15]:
s3 = pd.Series(d2, copy = True) # data(array) remains unchaged when we change series
s3[4] = 23452
d2

array([  1,   2,   3,   4, 234,   6])

#### if dict is passed as parameter in pd.sries() than it will take its key as indx and value as data eg

In [16]:
dict = {'adarsh' : 'coding', 'anu' : 'travelling', 'khedi' : 'enjoy'}
n = pd.Series(dict)
print(n)

adarsh        coding
anu       travelling
khedi          enjoy
dtype: object

### if scaler vlaues are given with index

In [17]:
n = pd.Series('adarsh', index = [0,1,2,3,4])

In [18]:
n

0    adarsh
1    adarsh
2    adarsh
3    adarsh
4    adarsh
dtype: object

### other examples

In [19]:
a = np.linspace(2, 33, 4)
ser1 = pd.Series(a)
ser1

0     2.000000
1    12.333333
2    22.666667
3    33.000000
dtype: float64

### DataFrame.astype(dtype, copy=None, errors='raise')
- Cast a pandas object to a specified dtype dtype

In [20]:
ser2 = pd.Series(a.astype(int))

In [21]:
ser2

0     2
1    12
2    22
3    33
dtype: int64

In [22]:
ser3 = pd.Series(np.arange(1,20,3), [x for x in 'abcdefg'])

In [23]:
ser3

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

### creating a series using a range function

In [24]:
sr4 = pd.Series(range(2,10), range(7, 15))

In [25]:
sr4

7     2
8     3
9     4
10    5
11    6
12    7
13    8
14    9
dtype: int64

## accessing elemments of series

there are two ways through which we can access elelment sof series:
- accessing element from series using position
- accesiing element using index(label)

In [26]:
sr2 = pd.Series(np.arange(0,6), np.arange(7, 13))

In [27]:
sr2

7     0
8     1
9     2
10    3
11    4
12    5
dtype: int64

#### it's recommended to avoid using integer labels when defining the index of a pandas Series if you plan to access elements by position. Instead, use non-integer labels or rely on positional indexing with ||____iloc____||.

when the labels are given in inteegr than we cannot access the series by using postion **to access with series we can use iloc**

In [28]:
sr2[2]

KeyError: 2

In [29]:
sr2.iloc[2]

2

#### continue to (accssing elements of series)

In [30]:
sr3 = pd.Series(range(0, 9), [x for x in 'abcdefghi'])

In [31]:
sr3[2]

/var/folders/4y/tgmzjnfd59s7t57bcx5m1lzc0000gn/T/ipykernel_93344/589054859.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sr3[2]

2

In [32]:
sr3.iloc[2]

2

In [33]:
sr3['c']

2

In [34]:
sr3.loc['a']

0

# reading files in panda

to read files we simply have to write pandas.read_(type o file)

In [35]:
df9 = pd.DataFrame(range(0,9)).T
df9

   0  1  2  3  4  5  6  7  8
0  0  1  2  3  4  5  6  7  8

In [36]:
df10 = pd.read_csv("data.csv")

## in pandas .T extension is used for transposing the dataframe

In [39]:
df9 = pd.read_csv("customer_cases.csv")

In [40]:
df9 = df9.T

## to save the dataframe in desired format we can use 
- DF.to_csv(desired format)

In [41]:
df9.to_csv("data.csv")

In [42]:
df10 = pd.read_csv("data.csv")
df10

,Unnamed: 0,0,1,2,3,4,5,6,7,8,...,330502,330503,330504,330505,330506,330507,330508,330509,330510,330511
0,Unnamed: 0,1,2,3,4,5,6,7,8,9,...,330503,330504,330505,330506,330507,330508,330509,330510,330511,330512
1,case_id,CC101,CC102,CC103,CC104,CC105,CC106,CC107,CC108,CC109,...,CC330603,CC330604,CC330605,CC330606,CC330607,CC330608,CC330609,CC330610,CC330611,CC330612
2,date_time,2017-01-01 10:32:03,2017-01-01 11:35:47,2017-01-01 11:37:09,2017-01-01 13:28:14,2017-01-01 13:52:22,2017-01-01 15:23:02,2017-01-01 15:30:36,2017-01-02 08:57:09,2017-01-02 09:17:09,...,2021-12-31 18:09:06,2021-12-31 18:20:30,2021-12-31 18:54:44,2021-12-31 19:09:10,2021-12-31 19:11:01,2021-12-31 19:16:28,2021-12-31 19:36:42,2021-12-31 20:30:02,2021-12-31 21:30:00,2022-01-01 06:32:53
3,customer_id,C2448,C2449,C2450,C2451,C2452,C2453,C2454,C2455,C2456,...,C506238,C484812,C124076,C126469,C120740,C173079,C497581,C127630,C497538,C485032
4,channel,phone,phone,phone,phone,phone,phone,phone,phone,phone,...,email,email,email,email,email,email,email,email,email,phone
5,reason,signup,signup,signup,signup,signup,signup,signup,signup,signup,...,support,support,support,support,support,support,support,support,support,support

# data frames

- a data frame is a two-dimensional tabular data structure that is similar to a spreadsheet or a SQL table. It is one of the    core data structures provided by pandas and is widely used for data analysis and manipulation.
- The correct syntax for creating a data frame using the DataFrame() function in pandas.
- **class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)**

parameters
- data(ndarray (structured or homogeneous), Iterable, dict, or DataFrame):  Dict can contain Series, arrays, constants, dataclass or list-like objects. If data is a dict, column order follows *insertion-order*. If a dict contains Series which have an index defined, it is aligned by its index. This alignment also occurs if data is a Series or a DataFrame itself. Alignment is done on Series/DataFrame inputs. If data is a list of dicts, column order follows insertion-order.
- index(Index or array-like);: Index to use for resulting frame. Will default to RangeIndex if no indexing information part of input data and no index provided.
- columns(Index or array-like): Column labels to use for resulting frame when data does not have them, defaulting to RangeIndex(0, 1, 2, …, n). If data contains column labels, will perform column selection instead.
- dtype(dtype, default None): Data type to force. Only a single dtype is allowed. If None, infer.
- copy(bool or None, default None): Copy data from inputs. For dict data, the default of None behaves like copy=True. For DataFrame or 2d ndarray input, the default of None behaves like copy=False. If data is a dict containing one or more Series (possibly of different dtypes), copy=False will ensure that these inputs are not copied

In [43]:
# to create a empty dataset
df = pd.DataFrame()

In [44]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [45]:
data = ['a','b','c','d']
df = pd.DataFrame(data)
df

   0
0  a
1  b
2  c
3  d

In [46]:
df = pd.DataFrame(data = np.arange(0,25).reshape(5,5), columns = ['a', 'b', 'c' ,'d', 'f'], index = [1,2,3,4,5], dtype = float)

In [47]:
df

      a     b     c     d     f
1   0.0   1.0   2.0   3.0   4.0
2   5.0   6.0   7.0   8.0   9.0
3  10.0  11.0  12.0  13.0  14.0
4  15.0  16.0  17.0  18.0  19.0
5  20.0  21.0  22.0  23.0  24.0

#### dictionary

In [48]:
dict = {'adarsh' :[7, '4th year', 'coding'], 'anu' :[9, '4th year', 'travelling'], 'khedi':[37, '4th year', 'hiking']}
df1 = pd.DataFrame(data = dict, index = ['rol no', 'year', 'hobby'])

In [49]:
df1

          adarsh         anu     khedi
rol no         7           9        37
year    4th year    4th year  4th year
hobby     coding  travelling    hiking

In [50]:
df1.values

array([[7, 9, 37],
       ['4th year', '4th year', '4th year'],
       ['coding', 'travelling', 'hiking']], dtype=object)

In [51]:
df1.columns

Index(['adarsh', 'anu', 'khedi'], dtype='object')

In [52]:
df1.index

Index(['rol no', 'year', 'hobby'], dtype='object')

#### zip function : combine two list in form of tupple

In [53]:
age = [18,19,20,21,29]
name = ['adarsh', 'anu', 'khedi', 'tushar', 'kd']
df3 = pd.DataFrame(zip(age,name), [1, 2, 3, 4, 5], ['age', 'name'])

In [54]:
df3

   age    name
1   18  adarsh
2   19     anu
3   20   khedi
4   21  tushar
5   29      kd

#### we can initialize iindex directly in dictionary instead of later dwfining it in DataFramea by using series

In [55]:
d={'one': [10,20,30,40,50],
   'two':[60,70,80,90,100], 
  'three': [30,40,50,60,70], 'four':[60,70,80,90,100]}
df4 = pd.DataFrame(d)
df4

   one  two  three  four
0   10   60     30    60
1   20   70     40    70
2   30   80     50    80
3   40   90     60    90
4   50  100     70   100

In [56]:
d={'one': pd.Series([10,20,30,40,50], index=['a', 'b', 'c', 'd', 'e']),
   'two':pd.Series([60,70,80,90,100], index=['f', 'g', 'h', 'i', 'j']),
  'three': pd.Series([10,20,30,40,50], index=['a', 'b', 'c', 'd', 'e']),
   'four':pd.Series([60,70,80,90,100], index=['f', 'g', 'h', 'i', 'j'])}
df4 = pd.DataFrame(d)

In [57]:
df4

    one    two  three   four
a  10.0    NaN   10.0    NaN
b  20.0    NaN   20.0    NaN
c  30.0    NaN   30.0    NaN
d  40.0    NaN   40.0    NaN
e  50.0    NaN   50.0    NaN
f   NaN   60.0    NaN   60.0
g   NaN   70.0    NaN   70.0
h   NaN   80.0    NaN   80.0
i   NaN   90.0    NaN   90.0
j   NaN  100.0    NaN  100.0

## dealing with rows and columns

accesing speecific columns 
- <DataFrame Object> [ [<Column Name1> , <Column Name2>,<Column Name3> ]]

In [58]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Henry', 'Ivy', 'Jack'],
    'Age': [25, 30, 35, 28, 32, 27, 31, 29, 34, 26],
    'Qualification': ['Bachelor', 'Master', 'PhD', 'Master', 'Bachelor', 'Master', 'PhD', 'Bachelor', 'Master', 'PhD'],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'City': ['New York', 'London', 'Tokyo', 'Paris', 'Berlin', 'Sydney', 'Toronto', 'Mumbai', 'Singapore', 'Dubai'],
    'Country': ['USA', 'UK', 'Japan', 'France', 'Germany', 'Australia', 'Canada', 'India', 'Singapore', 'UAE']
}

df = pd.DataFrame(data)
print(df[['Name', 'Gender']])

      Name  Gender
0    Alice  Female
1      Bob    Male
2  Charlie    Male
3    David    Male
4      Eva  Female
5    Frank    Male
6    Grace  Female
7    Henry    Male
8      Ivy  Female
9     Jack    Male

### to access single element we can use **at** or **iat** attribute

In [59]:
df.at[1, 'Name']
#    row  column

'Bob'

In [60]:
df.iat[1,0]

'Bob'

### to access only rows from dataframe we can use either loc attribute or iloc attribute

In [61]:
df.loc[3]

Name              David
Age                  28
Qualification    Master
Gender             Male
City              Paris
Country          France
Name: 3, dtype: object

In [62]:
df.iloc[3]

Name              David
Age                  28
Qualification    Master
Gender             Male
City              Paris
Country          France
Name: 3, dtype: object

In [63]:
df.loc[[3]]

    Name  Age Qualification Gender   City Country
3  David   28        Master   Male  Paris  France

## working with missing data in dataframes

Working with missing data in pandas involves handling and managing the absence of values or NaN (Not a Number) values in a data frame. Pandas provides several methods and functions to handle missing data effectively.

Here are some common operations for working with missing data in pandas:
- Detecting missing values:
   **isnull() and notnull()**: These functions return a Boolean mask indicating which values are missing or not missing, respectively, in the data frame or a specific column.
   
- Dropping missing values:
  **dropna()** : his function is used to drop rows or columns that contain missing values. It allows you to specify the axis (rows or columns) and other parameters to control the behavior of dropping.
  
- filling missing values:  
  **fillna()**: This function is used to fill missing values with a specified value or a predefined strategy. It can fill missing values forward or backward (using the previous or next non-missing value), or fill with a constant value, mean, median, or mode of the column.

- Replacing missing values:
  **replace()**: This function can be used to replace specific values, including missing values, with other values of your choice.
- interpolating missing values:
  **intepolate()**: This function is used to interpolate missing values based on various interpolation methods such as linear, quadratic, cubic, etc. It estimates missing values based on existing values in a column or data frame.
  
- Counting missing values:
  **isnull().sum()** : This expression returns the count of missing values in each column of the data frame.
  **count()**: This function returns the count of non-missing values in each column.

In [64]:
data = {'A': [1, 2, np.nan, 4],
        'B': [5, np.nan, 7, 8],
        'C': [np.nan, 10, 11, 12]}
df = pd.DataFrame(data)
df

     A    B     C
0  1.0  5.0   NaN
1  2.0  NaN  10.0
2  NaN  7.0  11.0
3  4.0  8.0  12.0

In [65]:
df.isnull()

       A      B      C
0  False  False   True
1  False   True  False
2   True  False  False
3  False  False  False

#### Check if any values are missing in each column **.isnull().any()**

In [66]:
df.isnull().any()

A    True
B    True
C    True
dtype: bool

#### Check if all values are missing in each column **isnull().all()

In [67]:
df.isnull().all()

A    False
B    False
C    False
dtype: bool

### Dropping mising values

#### Drop rows with missing values
- DataFrame.dropna(*, axis=0, how=_NoDefault.no_default, thresh=_NoDefault.no_default, subset=None, inplace=False, ignore_index=False)
- axis{0 or ‘index’, 1 or ‘columns’}, default 0
Determine if rows or columns which contain missing values are removed.
0, or ‘index’ : Drop rows which contain missing values.
1, or ‘columns’ : Drop columns which contain missing value.
Only a single axis is allowed.
how{‘any’, ‘all’}, default ‘any’
Determine if row or column is removed from DataFrame, when we have at least one NA or all NA.
‘any’ : If any NA values are present, drop that row or column.
‘all’ : If all values are NA, drop that row or column.
threshint, optional
Require that many non-NA values. Cannot be combined with how.
subsetcolumn label or sequence of labels, optional
Labels along other axis to consider, e.g. if you are dropping rows these would be a list of columns to include.
inplacebool, default False
Whether to modify the DataFrame rather than creating a new one.
ignore_indexbool, default False
If True, the resulting axis will be labeled 0, 1, …, n - 1.

In [68]:
df.dropna()

     A    B     C
3  4.0  8.0  12.0

In [69]:
print(df.dropna(axis = 1))

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

### Filling missing values

#### Fill missing values with a constant value **fillna(K)

In [70]:
df.fillna(9)

     A    B     C
0  1.0  5.0   9.0
1  2.0  9.0  10.0
2  9.0  7.0  11.0
3  4.0  8.0  12.0

#### Fill missing values with the mean of the column

In [71]:
df.fillna(df.mean(axis = 0))

          A         B     C
0  1.000000  5.000000  11.0
1  2.000000  6.666667  10.0
2  2.333333  7.000000  11.0
3  4.000000  8.000000  12.0

#### Fill missing values forward (use the previous non-missing value)

In [80]:
print(df.fillna(method='ffill', axis = 0))

     A    B     C
0  1.0  5.0   NaN
1  2.0  5.0  10.0
2  2.0  7.0  11.0
3  4.0  8.0  12.0

/var/folders/4y/tgmzjnfd59s7t57bcx5m1lzc0000gn/T/ipykernel_93344/508128694.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='ffill', axis = 0))

In [79]:
df.ffill()

     A    B     C
0  1.0  5.0   NaN
1  2.0  5.0  10.0
2  2.0  7.0  11.0
3  4.0  8.0  12.0

In [81]:
df.fillna(method='ffill', axis = 1)

/var/folders/4y/tgmzjnfd59s7t57bcx5m1lzc0000gn/T/ipykernel_93344/2484479613.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis = 1)

     A    B     C
0  1.0  5.0   5.0
1  2.0  2.0  10.0
2  NaN  7.0  11.0
3  4.0  8.0  12.0

In [82]:
df.fillna(method='bfill')

/var/folders/4y/tgmzjnfd59s7t57bcx5m1lzc0000gn/T/ipykernel_93344/2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

     A    B     C
0  1.0  5.0  10.0
1  2.0  7.0  10.0
2  4.0  7.0  11.0
3  4.0  8.0  12.0

In [87]:
df.ffill(axis = 1)

     A    B     C
0  1.0  5.0   5.0
1  2.0  2.0  10.0
2  NaN  7.0  11.0
3  4.0  8.0  12.0

### replace missing values

In [88]:
df.replace(10 , -9)

     A    B     C
0  1.0  5.0   NaN
1  2.0  NaN  -9.0
2  NaN  7.0  11.0
3  4.0  8.0  12.0

In [89]:
df.replace(np.nan, 0)

     A    B     C
0  1.0  5.0   0.0
1  2.0  0.0  10.0
2  0.0  7.0  11.0
3  4.0  8.0  12.0

### interpolate missing vlaues

In [90]:
df.interpolate()

     A    B     C
0  1.0  5.0   NaN
1  2.0  6.0  10.0
2  3.0  7.0  11.0
3  4.0  8.0  12.0

### counting missing values:

In [112]:
df.isnull().sum()

Unnamed: 0     0
case_id        0
date_time      0
customer_id    0
channel        0
reason         0
dtype: int64

In [113]:
df.isnull().sum().sum()# to count all the missing value present in dadtaframe

0

In [114]:
df.count()

Unnamed: 0     330512
case_id        330512
date_time      330512
customer_id    330512
channel        330512
reason         330512
dtype: int64

## iterating over rows and columns

In [115]:
data = {'A': [1, 2, 3],
        'B': [4, 5, 6],
        'C': [7, 8, 9]}

df = pd.DataFrame(data)

### using iterrows():

In [116]:
for index, rows in df.iterrows():
    print(f"Row index: {index}")
    print(f"row data {rows.values}")
    print(f"single value {rows.iloc[2]}")# to access specific column's row value in iterrows
    print(f"b's value {rows['B']}")

Row index: 0
row data [1 4 7]
single value 7
b's value 4
Row index: 1
row data [2 5 8]
single value 8
b's value 5
Row index: 2
row data [3 6 9]
single value 9
b's value 6

In [117]:
for index, row in df.iterrows():
    print(f"Row index: {index}")
    print(f"Row values: {row}")

Row index: 0
Row values: A    1
B    4
C    7
Name: 0, dtype: int64
Row index: 1
Row values: A    2
B    5
C    8
Name: 1, dtype: int64
Row index: 2
Row values: A    3
B    6
C    9
Name: 2, dtype: int64

### iterating over columns using iteritems:

In [118]:
for column_name, column_data in df.items():
    print(f"Column name: {column_name}")
    print(f"Column values: {column_data}\n")

Column name: A
Column values: 0    1
1    2
2    3
Name: A, dtype: int64

Column name: B
Column values: 0    4
1    5
2    6
Name: B, dtype: int64

Column name: C
Column values: 0    7
1    8
2    9
Name: C, dtype: int64

In [119]:
for column_name, column_data in df.items():
    print(f"Column name: {column_name}")
    print(f"Column values: {column_data.values}\n")
    print(f"Column at first row: {column_data[1]}")# accessing specific rows column daata

Column name: A
Column values: [1 2 3]

Column at first row: 2
Column name: B
Column values: [4 5 6]

Column at first row: 5
Column name: C
Column values: [7 8 9]

Column at first row: 8

## pandas DataFrame/Series.head() method:
The head() method in pandas is used to return the first n rows of a DataFrame or Series. It provides a convenient way to quickly inspect the beginning of a dataset or a subset of it.
- by default head shows 5 vlauesa

In [120]:
data = {'Name': ['John', 'Alice', 'Bob', 'Jane', 'Mike'],
        'Age': [25, 30, 35, 28, 32],
        'Country': ['USA', 'Canada', 'UK', 'Australia', 'Germany']}

df = pd.DataFrame(data)

In [121]:
df.head(3)

    Name  Age Country
0   John   25     USA
1  Alice   30  Canada
2    Bob   35      UK

In [122]:
df = pd.read_csv('customer_cases.csv')

In [123]:
df.head()

   Unnamed: 0 case_id            date_time customer_id channel  reason
0           1   CC101  2017-01-01 10:32:03       C2448   phone  signup
1           2   CC102  2017-01-01 11:35:47       C2449   phone  signup
2           3   CC103  2017-01-01 11:37:09       C2450   phone  signup
3           4   CC104  2017-01-01 13:28:14       C2451   phone  signup
4           5   CC105  2017-01-01 13:52:22       C2452   phone  signup

## Dataframe/Series.tail() method:
- the tail() method in pandas is used to return the last n rows of a Dataframe or series. It is similar to head() method, but it displays the end portions of the dataset

In [124]:
df.tail()

        Unnamed: 0   case_id            date_time customer_id channel   reason
330507      330508  CC330608  2021-12-31 19:16:28     C173079   email  support
330508      330509  CC330609  2021-12-31 19:36:42     C497581   email  support
330509      330510  CC330610  2021-12-31 20:30:02     C127630   email  support
330510      330511  CC330611  2021-12-31 21:30:00     C497538   email  support
330511      330512  CC330612  2022-01-01 06:32:53     C485032   phone  support

In [125]:
df.tail(9)

        Unnamed: 0   case_id            date_time customer_id channel   reason
330503      330504  CC330604  2021-12-31 18:20:30     C484812   email  support
330504      330505  CC330605  2021-12-31 18:54:44     C124076   email  support
330505      330506  CC330606  2021-12-31 19:09:10     C126469   email  support
330506      330507  CC330607  2021-12-31 19:11:01     C120740   email  support
330507      330508  CC330608  2021-12-31 19:16:28     C173079   email  support
330508      330509  CC330609  2021-12-31 19:36:42     C497581   email  support
330509      330510  CC330610  2021-12-31 20:30:02     C127630   email  support
330510      330511  CC330611  2021-12-31 21:30:00     C497538   email  support
330511      330512  CC330612  2022-01-01 06:32:53     C485032   phone  support

## pandas Dataframe.to_numpy()
  to_numpy() method in pandas is used to convert a DataFrame to its underlying NumPy array representation. It returns a NumPy array containing the values from the DataFrame.

In [126]:
data = {'Name': ['John', 'Alice', 'Bob'],
        'Age': [25, 30, 35],
        'Country': ['USA', 'Canada', 'UK']}

df = pd.DataFrame(data)

# Convert DataFrame to NumPy array
numpy_array = df.to_numpy()

print(numpy_array)

[['John' 25 'USA']
 ['Alice' 30 'Canada']
 ['Bob' 35 'UK']]

In [127]:
df = pd.DataFrame(numpy_array,[0,1,2], ['name', 'age', 'countary'])
df

    name age countary
0   John  25      USA
1  Alice  30   Canada
2    Bob  35       UK

## pandas DataFrame.describe() method
The describe() method in pandas is used to generate descriptive statistics of a DataFrame. It provides a summary of the central tendency, dispersion, and shape of the distribution of numerical columns in the DataFrame.

In [128]:
data = {'Name': ['John', 'Alice', 'Bob', 'Jane', 'Mike'],
        'Age': [25, 30, 35, 28, 32],
        'Salary': [50000, 60000, 70000, 55000, 65000]}

df = pd.DataFrame(data)

# Generate descriptive statistics of the DataFrame
description = df.describe()

print(description)

             Age       Salary
count   5.000000      5.00000
mean   30.000000  60000.00000
std     3.807887   7905.69415
min    25.000000  50000.00000
25%    28.000000  55000.00000
50%    30.000000  60000.00000
75%    32.000000  65000.00000
max    35.000000  70000.00000

## pandas Series.to_numpy():
The Series.to_numpy() method in Pandas is used to convert a Pandas series object into a NumPy array.

The method returns a one-dimensional NumPy array that contains the same data as the Pandas series. This can be useful for performing numerical computations using the powerful tools available in NumPy.

In [129]:
sr = pd.Series([1,2,3,4,5,6])
sr.to_numpy()

array([1, 2, 3, 4, 5, 6])

In [130]:
sr.values

array([1, 2, 3, 4, 5, 6])

## dealing with rows and columns in panda dadtaframe:

Pandas is a powerful library in Python for data manipulation and analysis. It provides a DataFrame object, which is a two-dimensional labeled data structure similar to a table or spreadsheet. In Pandas, you can deal with rows and columns in a DataFrame using various operations.

### dealing with columns

Dealing with columns in a Pandas DataFrame involves various operations such as accessing columns, renaming columns, adding new columns, deleting columns, and performing calculations on columns.

#### accessing columns:
To access a specific column in a DataFrame, you can use the indexing operator [] with the column name as a string. For example, if you have a DataFrame called df and you want to access the column "column_name", you can use df["column_name"]. This will return a Series object containing the values of that column.

In [131]:
data = {
    "Name": ["John", "Emma", "Ryan"],
    "Age": [25, 28, 32],
    "City": ["New York", "Paris", "London"]
}
df = pd.DataFrame(data)
# now to access specific columns for example in above df to access age:
df['Age']

0    25
1    28
2    32
Name: Age, dtype: int64

In [132]:
# to access multiplw columns:
df[['Age','Name']]

   Age  Name
0   25  John
1   28  Emma
2   32  Ryan

#### to raname columns:
To rename a column in a DataFrame, you can use the rename() method. It allows you to provide a dictionary where the keys represent the current column names, and the values represent the new column names. For example, df = df.rename(columns={"old_name": "new_name"}) will rename the column "old_name" to "new_name" in the DataFrame.

- we can also renaem index using this method

In [133]:
df.rename(columns={'Age': 'ame'})

   Name  ame      City
0  John   25  New York
1  Emma   28     Paris
2  Ryan   32    London

In [134]:
df.rename(index={0:9, 1:10})

    Name  Age      City
9   John   25  New York
10  Emma   28     Paris
2   Ryan   32    London

In [135]:
df.rename(columns = {'Name':'name', 'Age':'age'})

   name  age      City
0  John   25  New York
1  Emma   28     Paris
2  Ryan   32    London

### adding new columns:
To add a new column to a DataFrame, you can assign a new Series or an array to a new column name. For example, **df["new_column"] = [1, 2, 3, 4]** will add a new column called "new_column" to the DataFrame and populate it with the provided values.

In [136]:
df['ada'] = [2,3,4]

In [137]:
df

   Name  Age      City  ada
0  John   25  New York    2
1  Emma   28     Paris    3
2  Ryan   32    London    4

#### the other method to add columns is insert(a, b ,c) method
where a is index of coluns wheere u want to insert it and b is name of column and c is the values that eill be filled in column

In [138]:
df.insert(2,'adore', [4,5,6])

In [139]:
df

   Name  Age  adore      City  ada
0  John   25      4  New York    2
1  Emma   28      5     Paris    3
2  Ryan   32      6    London    4

### to delete the columns in df:
To delete a column from a DataFrame, you can use the drop() function. For example, df = df.drop("column_name", axis=1) will remove the column named "column_name" from the DataFrame. The axis=1 parameter specifies that you are dropping a column.

- can also drop rows using drop

In [140]:
df.drop('ada', axis = 1)

   Name  Age  adore      City
0  John   25      4  New York
1  Emma   28      5     Paris
2  Ryan   32      6    London

In [145]:
df.drop('adore', axis = 1)

   Name  Age      City  ada  sum
0  John   25  New York    2   27
1  Emma   28     Paris    3   31
2  Ryan   32    London    4   36

In [141]:
# to drop the rows 
df.drop(0)

   Name  Age  adore    City  ada
1  Emma   28      5   Paris    3
2  Ryan   32      6  London    4

### calculaations on columns:
You can perform calculations on columns using arithmetic operators. For example, if you have two columns "column1" and "column2" in a DataFrame, you can create a new column "sum_column" that contains the sum of the two columns using the following syntax: df["sum_column"] = df["column1"] + df["column2"]. Similarly, you can use other arithmetic operators like subtraction (-), multiplication (*), and division (/) to perform calculations on columns.

In [142]:
df['sum'] = df['Age'] + df.ada

In [143]:
df

   Name  Age  adore      City  ada  sum
0  John   25      4  New York    2   27
1  Emma   28      5     Paris    3   31
2  Ryan   32      6    London    4   36

In [146]:
df["modulas"]= df.Age % df.ada

In [147]:
df

   Name  Age  adore      City  ada  sum  modulas
0  John   25      4  New York    2   27        1
1  Emma   28      5     Paris    3   31        1
2  Ryan   32      6    London    4   36        0

### applying functions to columns:
Pandas provides the apply() method to apply a function to each element of a column. You can define a custom function and use apply() to apply it to a column. For example, if you have a column "column_name" and you want to apply a function called my_function to each element of that column, you can use the following syntax: df["column_name"] = df["column_name"].apply(my_function).

In [148]:
def age_to_days(a):
    return a * 365

df["age in days"]=df.Age.apply(age_to_days)

In [149]:
df

   Name  Age  adore      City  ada  sum  modulas  age in days
0  John   25      4  New York    2   27        1         9125
1  Emma   28      5     Paris    3   31        1        10220
2  Ryan   32      6    London    4   36        0        11680

In [150]:
# we can also apply functions in traditional ways
def sumi(a,b):
    return a+b
df['sumi'] = sumi(df.Age, df.ada)

In [151]:
df

   Name  Age  adore      City  ada  sum  modulas  age in days  sumi
0  John   25      4  New York    2   27        1         9125    27
1  Emma   28      5     Paris    3   31        1        10220    31
2  Ryan   32      6    London    4   36        0        11680    36

In [152]:
def sumi(a,b):
    return a+b
sumi = sumi(df.Age, df.ada)
sumi

0    27
1    31
2    36
dtype: int64

### pandas.DataFrame.set_index
Set the DataFrame index using existing columns.

Set the DataFrame index (row labels) using one or more existing columns or arrays (of the correct length). The index can replace the existing index or expand on it.

- DataFrame.set_index(keys, *, drop=True, append=False, inplace=False, verify_integrity=False)
- keys: label or array-like or list of labels/arrays : This parameter can be either a single column key, a single array of the same length as the calling DataFrame, or a list containing an arbitrary combination of column keys and arrays. Here, “array” encompasses Series, Index, np.ndarray, and instances of Iterator.
- drop: bool, default True :Delete columns to be used as the new index.
- append: bool, default False: Whether to append columns to existing index.
- inplace: bool, default False:Whether to modify the DataFrame rather than creating a new one.
- verify_integrity: bool, default False:Check the new index for duplicates. Otherwise defer the check until necessary. Setting to False will improve the performance of this method.

In [153]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})

In [154]:
df.set_index('month')
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [155]:
df.set_index('month', inplace = True)
df

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [156]:
df.set_index('sale', append = True)

            year
month sale
1     55    2012
4     40    2014
7     84    2013
10    31    2014

## dealing with rows:
Dealing with rows in a Pandas DataFrame involves operations such as accessing rows, filtering rows based on conditions, adding new rows, and deleting rows.

#### accessing rows:

Pandas provide different methods to access rows in dataframe:

**iloc:**

to use the iloc indexer to access rows by their integer location. For example, to access the first row of a DataFrame, you can use df.iloc[0]. iloc: You can use the iloc indexer to access rows by their integer location. For example, to access the first row of a DataFrame, you can use df.iloc[0].

**loc:**

The loc indexer is used to access rows by their label. If your DataFrame has row labels, you can use the loc indexer to access rows by their labels. For example, if you have a DataFrame with row labels and you want to access the row with label "row_label", you can use df.loc["row_label"].

In [157]:
data = {
    "Name": ["John", "Emma", "Ryan"],    
    "Age": [25, 28, 32],
    "City": ["New York", "Paris", "London"]}
df = pd.DataFrame(data, index = ['A', 'B','C'])

In [158]:
df.loc[['A']]

   Name  Age      City
A  John   25  New York

In [159]:
df.loc[['A','B']]

   Name  Age      City
A  John   25  New York
B  Emma   28     Paris

In [160]:
df.iloc[[0,1]]

   Name  Age      City
A  John   25  New York
B  Emma   28     Paris

**Boolean indexing:**

to use Boolean indexing to filter rows based on a condition. For example, if you want to select rows where a certain condition is met, you can use a Boolean expression with the DataFrame. For example, df[df["column_name"] > 10] will select rows where the value in "column_name" is greater than 10.

In [161]:
df[df['Age']>28]

   Name  Age    City
C  Ryan   32  London

### adding rows:
to add a new row to a DataFrame, you can use the append() function or the loc indexer.

In [162]:
# 1 menthod
df = pd.DataFrame({'Name': ['John', 'Emma'],
                   'Age': [25, 28]})

df.loc[len(df)] = ['adi', 3]

In [163]:
df

   Name  Age
0  John   25
1  Emma   28
2   adi    3

#### concat() 
- pandas.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=True)
- ignore_index(bool, default False): If True, do not use the index values along the concatenation axis. The resulting axis will be labeled 0, …, n - 1. This is useful if you are concatenating objects where the concatenation axis does not have meaningful indexing information. Note the index values on the other axes are still respected in the join.

In [164]:
df1 = pd.DataFrame(data = [['anu', '4'],['amu',5]], columns = ['Name', 'Age'])

In [165]:
df1

  Name Age
0  anu   4
1  amu   5

In [166]:
df2 = pd.concat([df,df1])

In [167]:
df2

   Name Age
0  John  25
1  Emma  28
2   adi   3
0   anu   4
1   amu   5

In [168]:
df2 = pd.concat([df,df1], ignore_index = True)

In [169]:
df2

   Name Age
0  John  25
1  Emma  28
2   adi   3
3   anu   4
4   amu   5

### row deletion
- drop command is used for row deletion
- DataFrame.drop(labels=None, *, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')
- touple wil be used in label instead of list etc

In [170]:
df2.drop([3,4])

   Name Age
0  John  25
1  Emma  28
2   adi   3

In [171]:
df.drop(['Age'], axis = 1)

   Name
0  John
1  Emma
2   adi

## Pandas Dataframe.truncate
- DataFrame.truncate(before=None, after=None, axis=None, copy=None)
- The truncate method in Pandas DataFrame is used to truncate(cut) a DataFrame or Series before and/or after a specified index or column label. It allows you to filter and keep only the data within a specific range.
- 1. before: The label or index before which to truncate the DataFrame.          
2. after: The label or index after which to truncate the DataFrame.              
3. axis: Specifies the axis along which to truncate. By default, it is set to None, which means the method will truncate the rows.         
4. copy: Specifies whether to make a copy of the truncated DataFrame or modify the original DataFrame in place. By default, it is set to True.

In [176]:
data = {'A': [1, 2, 3, 4, 5],
        'B': [6, 7, 8, 9, 10]}
df = pd.DataFrame(data)
print(df)

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [177]:
# df.truncate(before = 2, after =3)
df.truncate(2,3)

   A  B
2  3  8
3  4  9

In [178]:
df.truncate(4)

   A   B
4  5  10

In [179]:
df.truncate(after = 3)

   A  B
0  1  6
1  2  7
2  3  8
3  4  9

### Pandas Series.combine():

- The combine method in Pandas Series is used to combine two Series into a new Series by applying a given function element-wise. It allows you to perform custom operations on two Series and generate a new Series based on those operations.
- **Series.combine(other, func, fill_value=None)**


Parameters:

1. other: The other Series to combine with.
2. func: A function that specifies how to combine the values from the two Series. This function takes two arguments, corresponding to the values from the two Series, and returns a single value.
3. fill_value: An optional parameter that specifies a value to fill missing values with. If one of the Series has missing values where the other Series has data, the fill_value will be used in those cases.

In [180]:
sr = pd.Series(['a', 'b', 'c','d','e', 'f','g'])
sr1 = pd.Series(['h','i','j','k'])

In [181]:
def funk(a,b):
    return([a,b])
def sunk(a,b):
    return a+b

In [182]:
sr.combine(sr1, funk)

0      [a, h]
1      [b, i]
2      [c, j]
3      [d, k]
4    [e, nan]
5    [f, nan]
6    [g, nan]
dtype: object

In [183]:
sr2 = pd.Series(['a', 'b', 'c','d','e', 'f','g'])
sr.combine(sr2, sunk)

0    aa
1    bb
2    cc
3    dd
4    ee
5    ff
6    gg
dtype: object

In [184]:
# Create two sample Series with null values
s1 = pd.Series([1, 2, np.nan, 4, 5])
s2 = pd.Series([10, 20, 30, np.nan, 50])

# Define a function to combine the values from the two Series
def custom_function(x, y):
    return x + y

# Combine the two Series using the custom function and fill null values with 5
combined_series = s2.combine(s1,custom_function, fill_value=5)
# print(s1)

print(combined_series)

0    11.0
1    22.0
2     NaN
3     NaN
4    55.0
dtype: float64

In [185]:
           
first =[1, 2, np.nan,9] 
#         0  1   2      3  4  5   6
# creating second series 
second =[5, 3, 3,np.nan] 
#         0   1   2   3     4   5  6
# making series 
first = pd.Series(first) 
 
# making seriesa 
second = pd.Series(second) 
 
# calling .combine() method 
result = first.combine(second, func =(lambda x1, x2: x1 if x1 > x2 else x2), fill_value = 1) 
 
# display 
print(second)

0    5.0
1    3.0
2    3.0
3    NaN
dtype: float64

### Pandas Index.append()
The Index.append() method in pandas is used to concatenate or append one index with another. It returns a new index object that includes all the elements from both indexes.

The syntax for Index.append() is as follows:


Index.append(other)



Index refers to the initial index object, and other represents the index object that you want to append to the initial index

In [186]:
import pandas as pd

index1 = pd.Index(['A', 'B', 'C'])
index2 = pd.Index(['D', 'E', 'F'])

appended_index = index1.append(index2)
print(appended_index)

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

### concat by using axis

To concatenate DataFrames using the pd.concat() function along a specific axis, you can specify the axis parameter. The axis parameter determines the axis along which the concatenation should occur. By default, axis is set to 0, which means concatenation along the rows. If you want to concatenate along the columns, you can set axis to 1.

In [187]:
# on axis =0
import pandas as pd

df1 = pd.DataFrame({'A': [1, 2, 3],
         'B': [4, 5, 6]})
print(df1)

df2 = pd.DataFrame ({'C': [7, 8, 9],
         'D': [10, 11, 12]})
print(df2)

print(pd.concat([df1, df2], axis=1))
print(pd.concat([df1, df2]))

   A  B
0  1  4
1  2  5
2  3  6
   C   D
0  7  10
1  8  11
2  9  12
   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12
     A    B    C     D
0  1.0  4.0  NaN   NaN
1  2.0  5.0  NaN   NaN
2  3.0  6.0  NaN   NaN
0  NaN  NaN  7.0  10.0
1  NaN  NaN  8.0  11.0
2  NaN  NaN  9.0  12.0

### To concatenate DataFrames using the pd.concat()
function with a specific join method, you can use the join parameter. The join parameter determines how the other axes (if any) should be handled during the concatenation process.

The join parameter in pd.concat() can take the following values:

'outer': Performs a union of the indexes/columns. This is the default behavior.
'inner': Performs an intersection of the indexes/columns.
- **join{‘inner’, ‘outer’}, default ‘outer’**: How to handle indexes on other axis (or axes).

In [188]:
import pandas as pd


df1 = pd.DataFrame({'A': [1, 2, 3],
         'B': [4, 5, 6]})

df2 = pd.DataFrame ({'C': [7, 8, 9],
         'D': [10, 11, 12]})

print("Concatenation with 'outer' join:")
print(pd.concat([df1, df2], join='outer'))
print("\nConcatenation with 'inner' join:")
print(pd.concat([df1, df2], join='inner'))

Concatenation with 'outer' join:
     A    B    C     D
0  1.0  4.0  NaN   NaN
1  2.0  5.0  NaN   NaN
2  3.0  6.0  NaN   NaN
0  NaN  NaN  7.0  10.0
1  NaN  NaN  8.0  11.0
2  NaN  NaN  9.0  12.0

Concatenation with 'inner' join:
Empty DataFrame
Columns: []
Index: [0, 1, 2, 0, 1, 2]

In [189]:
df1 = pd.DataFrame({'A': [1, 2, 3],
         'B': [4, 5, 6]})

df2 = pd.DataFrame ({'C': [7, 8, 9],
         'D': [10, 11, 12],
         'A':[11,21,np.nan],
         'B':[23,21,np.nan]})
pd.concat([df1,df2], join = 'inner')

      A     B
0   1.0   4.0
1   2.0   5.0
2   3.0   6.0
0  11.0  23.0
1  21.0  21.0
2   NaN   NaN

## Grouping Rows in pandas

rows together based on a specific column or a set of columns using the groupby() function. Grouping allows you to aggregate data, apply calculations within each group, or perform other operations on grouped data.

The basic syntax for grouping rows in pandas is as follows:

grouped = dataframe.groupby(by)
- Used to determine the groups for the groupby. If by is a function, it’s called on each value of the object’s index. If a dict or Series is passed, the Series or dict VALUES will be used to determine the groups (the Series’ values are first aligned; see .align() method). If a list or ndarray of length equal to the selected axis is passed (see the groupby user guide), the values are used as-is to determine the groups. A label or list of labels may be passed to group by the columns in self. Notice that a tuple is interpreted as a (single) key.

In [190]:
import pandas as pd

data = {'Name': ['John', 'Alice', 'Bob', 'Alice'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'London', 'Paris', 'London']}

df = pd.DataFrame(data)

# Grouping by 'City'
grouped = df.groupby('City')

# Calculating the mean age for each city
mean_age = grouped['Age'].mean()

print(mean_age)

City
London      29.0
New York    25.0
Paris       35.0
Name: Age, dtype: float64

In [192]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})
print(df.groupby(['Animal']).mean())
df.groupby(['Animal'])['Max Speed'].mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

Animal
Falcon    375.0
Parrot     25.0
Name: Max Speed, dtype: float64

### the str.join() 
In pandas, the str.join() method is used to concatenate string or list elements with a passed delimiter. This method is available for string-type columns or columns containing lists of strings.

The basic syntax for str.join() is as follows:

series.str.join(sep)

In [193]:
data = {'Name': ['John', 'Alice', 'Bob'],
        'Fruit': [['Apple', 'Banana'], ['Orange'], ['Grapes', 'Mango']]}

df = pd.DataFrame(data)

# Joining elements in the 'Fruit' column with a comma as delimiter
df['Joined_Fruit'] = df['Fruit'].str.join('_')

print(df)

    Name            Fruit  Joined_Fruit
0   John  [Apple, Banana]  Apple_Banana
1  Alice         [Orange]        Orange
2    Bob  [Grapes, Mango]  Grapes_Mango

### str.cat()

To join two text columns into a single column in pandas, you can use the + operator or the str.cat() method. Both methods allow you to concatenate the values from two columns into a new column.

In [194]:
import pandas as pd

data = {'First Name': ['John', 'Alice', 'Bob'],
        'Last Name': ['Doe', 'Smith', 'Johnson']}

df = pd.DataFrame(data)

# Joining 'First Name' and 'Last Name' columns using the + operator
df['Full Name  '] = df['First Name'] + ' ' + df['Last Name']

print(df)

  First Name Last Name  Full Name
0       John       Doe     John Doe
1      Alice     Smith  Alice Smith
2        Bob   Johnson  Bob Johnson

In [195]:
df.drop(['Full Name  '], axis = 1)

  First Name Last Name
0       John       Doe
1      Alice     Smith
2        Bob   Johnson

In [196]:
df["Full Name"] = df['First Name'].str.cat(df['Last Name'], sep ='_')

In [197]:
df

  First Name Last Name  Full Name      Full Name
0       John       Doe     John Doe     John_Doe
1      Alice     Smith  Alice Smith  Alice_Smith
2        Bob   Johnson  Bob Johnson  Bob_Johnson

### The lambda function
to use a lambda function with the apply() method to join two text columns into a single column in pandas. The lambda function allows you to define a custom transformation on each row of the DataFrame.

In [198]:
import pandas as pd

data = {'First Name': ['John', 'Alice', 'Bob'],
        'Last Name': ['Doe', 'Smith', 'Johnson']}

df = pd.DataFrame(data)

# Joining 'First Name' and 'Last Name' columns using a lambda function
df['Full Name'] = df.apply(lambda row: row['First Name'] + ' ' + row['Last Name'], axis=1)

print(df)

  First Name Last Name    Full Name
0       John       Doe     John Doe
1      Alice     Smith  Alice Smith
2        Bob   Johnson  Bob Johnson

##  date and time 

Pandas provides robust functionality for working with date and time data through its Timestamp and DatetimeIndex objects. This allows you to handle various operations on dates and times, including parsing, formatting, indexing, arithmetic, and more.

#### Parsing and Creating Dates: 
to parse strings representing dates or times using the pd.to_datetime() function. It converts a wide range of date and time formats into Timestamp objects.

- pandas.to_datetime(arg, errors='raise', dayfirst=False, yearfirst=False, utc=False, format=None, exact=_NoDefault.no_default, unit=None, infer_datetime_format=_NoDefault.no_default, origin='unix', cache=True)

- arg(int, float, str, datetime, list, tuple, 1-d array, Series, DataFrame/dict-like):The object to convert to a datetime. If a DataFrame is provided, the method expects minimally the following columns: "year", "month", "day". The column “year” must be specified in 4-digit format.
- errors{‘ignore’, ‘raise’, ‘coerce’}, default ‘raise’
. If 'raise', then invalid parsing will raise an exception.
. If 'coerce', then invalid parsing will be set as NaT.
. If 'ignore', then invalid parsing will return the input.
- unit(str, default ‘ns’):The unit of the arg (D,s,ms,us,ns) denote the unit, which is an integer or float number. This will be based off the origin. Example, with unit='ms' and origin='unix', this would calculate the number of milliseconds to the unix epoch start.

In [199]:
date_string = '2023-05-24'
date = pd.to_datetime(date_string)
print(date)

2023-05-24 00:00:00

In [200]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
pd.to_datetime(df)

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [201]:
# - dayfirst=True is useful when your date strings are in a format where the day appears before the month. Here's an example:
date_string = '31-12-2023'

pd.to_datetime(date_string, dayfirst = True)

Timestamp('2023-12-31 00:00:00')

In [202]:
pd.to_datetime(date_string
              )

/var/folders/4y/tgmzjnfd59s7t57bcx5m1lzc0000gn/T/ipykernel_93344/1645351037.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  pd.to_datetime(date_string

Timestamp('2023-12-31 00:00:00')

In [203]:
pd.to_datetime(1490195805, unit='s')

Timestamp('2017-03-22 15:16:45')

In [204]:
pd.to_datetime(18205, unit='D')

Timestamp('2019-11-05 00:00:00')

#### DatetimeIndex:
Pandas has a specialized index object called DatetimeIndex, which allows you to index and manipulate data based on dates and times. You can create a DatetimeIndex from a list of dates or use it directly as the index of a DataFrame.

In [205]:
dates = ['2023-05-23', '2023-05-24', '2023-05-25']
values = [10, 20, 30]
df = pd.DataFrame({'Value': values}, index=pd.to_datetime(dates))
print(df)

            Value
2023-05-23     10
2023-05-24     20
2023-05-25     30

In [206]:
time = ['3243456790', '4334893752', '2334453478']
values = [10, 20, 30]
df = pd.DataFrame({'Value': values}, index=pd.to_datetime(time, unit = 's'))
print(df)

                     Value
2072-10-12 00:12:48     10
2107-05-15 09:06:08     20
2043-12-23 03:18:24     30

/var/folders/4y/tgmzjnfd59s7t57bcx5m1lzc0000gn/T/ipykernel_93344/2391352075.py:3: FutureWarning: The behavior of 'to_datetime' with 'unit' when parsing strings is deprecated. In a future version, strings will be parsed as datetime strings, matching the behavior without a 'unit'. To retain the old behavior, explicitly cast ints or floats to numeric type before calling to_datetime.
  df = pd.DataFrame({'Value': values}, index=pd.to_datetime(time, unit = 's'))

In [207]:
values = [10, 20, 30]
df = pd.DataFrame({'Value': values}, index=pd.to_datetime(['3243456790', '4334893752', '2334453478'], unit = 's'))
print(df)

                     Value
2072-10-12 00:12:48     10
2107-05-15 09:06:08     20
2043-12-23 03:18:24     30

/var/folders/4y/tgmzjnfd59s7t57bcx5m1lzc0000gn/T/ipykernel_93344/1188766123.py:2: FutureWarning: The behavior of 'to_datetime' with 'unit' when parsing strings is deprecated. In a future version, strings will be parsed as datetime strings, matching the behavior without a 'unit'. To retain the old behavior, explicitly cast ints or floats to numeric type before calling to_datetime.
  df = pd.DataFrame({'Value': values}, index=pd.to_datetime(['3243456790', '4334893752', '2334453478'], unit = 's'))

### Date Range Generation:
Pandas provides the pd.date_range() function to generate a range of dates based on specified frequency.
- pandas.date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, inclusive='both', *, unit=None, **kwargs)
- periods(int, optional): Number of periods to generate.
- freq: (str, Timedelta, datetime.timedelta, or DateOffset, default ‘D’): Frequency strings can have multiples, e.g. ‘5h’. See here( https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries-offset-aliases ) for a list of frequency aliases.

In [209]:
pd.date_range(start = '2023-10-02', end = '2024-12-31', freq = 'ME')

DatetimeIndex(['2023-10-31', '2023-11-30', '2023-12-31', '2024-01-31',
               '2024-02-29', '2024-03-31', '2024-04-30', '2024-05-31',
               '2024-06-30', '2024-07-31', '2024-08-31', '2024-09-30',
               '2024-10-31', '2024-11-30', '2024-12-31'],
              dtype='datetime64[ns]', freq='ME')

In [210]:
pd.date_range(start = '2023-10-02', end = '2024-12-31', periods = 7)

DatetimeIndex(['2023-10-02', '2023-12-17', '2024-03-02', '2024-05-17',
               '2024-08-01', '2024-10-16', '2024-12-31'],
              dtype='datetime64[ns]', freq=None)

#### Resampling and Shifting:
Pandas provides functions for resampling time series data, such as upsampling (increasing frequency) and downsampling (decreasing frequency), and shifting dates and times.

In [211]:
# resampling
import pandas as pd

# Create a DataFrame with a DatetimeIndex
dates = pd.date_range(start='2023-01-01', end='2023-12-31', freq='D')
values = range(len(dates))
df = pd.DataFrame({'Value': values}, index=dates)
print(df)

            Value
2023-01-01      0
2023-01-02      1
2023-01-03      2
2023-01-04      3
2023-01-05      4
...           ...
2023-12-27    360
2023-12-28    361
2023-12-29    362
2023-12-30    363
2023-12-31    364

[365 rows x 1 columns]

In [212]:
# resampling the data to  3 monthly frequeancy and calculating values monthly mean
df['Value'].resample('3M').mean()

/var/folders/4y/tgmzjnfd59s7t57bcx5m1lzc0000gn/T/ipykernel_93344/3390407819.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df['Value'].resample('3M').mean()

2023-01-31     15.0
2023-04-30     75.0
2023-07-31    165.5
2023-10-31    257.5
2024-01-31    334.0
Freq: 3ME, Name: Value, dtype: float64

In [213]:
df['Value'].resample('3M').std()

/var/folders/4y/tgmzjnfd59s7t57bcx5m1lzc0000gn/T/ipykernel_93344/2079641872.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df['Value'].resample('3M').std()

2023-01-31     9.092121
2023-04-30    25.836021
2023-07-31    26.702060
2023-10-31    26.702060
2024-01-31    17.752934
Freq: 3ME, Name: Value, dtype: float64

In [214]:
df['Value'].resample('15D').sum()

2023-01-01     105
2023-01-16     330
2023-01-31     555
2023-02-15     780
2023-03-02    1005
2023-03-17    1230
2023-04-01    1455
2023-04-16    1680
2023-05-01    1905
2023-05-16    2130
2023-05-31    2355
2023-06-15    2580
2023-06-30    2805
2023-07-15    3030
2023-07-30    3255
2023-08-14    3480
2023-08-29    3705
2023-09-13    3930
2023-09-28    4155
2023-10-13    4380
2023-10-28    4605
2023-11-12    4830
2023-11-27    5055
2023-12-12    5280
2023-12-27    1810
Freq: 15D, Name: Value, dtype: int64

In [215]:
df['Value'].resample('15D', label = 'right').sum()

2023-01-16     105
2023-01-31     330
2023-02-15     555
2023-03-02     780
2023-03-17    1005
2023-04-01    1230
2023-04-16    1455
2023-05-01    1680
2023-05-16    1905
2023-05-31    2130
2023-06-15    2355
2023-06-30    2580
2023-07-15    2805
2023-07-30    3030
2023-08-14    3255
2023-08-29    3480
2023-09-13    3705
2023-09-28    3930
2023-10-13    4155
2023-10-28    4380
2023-11-12    4605
2023-11-27    4830
2023-12-12    5055
2023-12-27    5280
2024-01-11    1810
Freq: 15D, Name: Value, dtype: int64

In [216]:
#To include this value close the right side of the bin interval, as shown below.
df['Value'].resample('15D', label = 'right', closed = 'right').sum()

2023-01-01       0
2023-01-16     120
2023-01-31     345
2023-02-15     570
2023-03-02     795
2023-03-17    1020
2023-04-01    1245
2023-04-16    1470
2023-05-01    1695
2023-05-16    1920
2023-05-31    2145
2023-06-15    2370
2023-06-30    2595
2023-07-15    2820
2023-07-30    3045
2023-08-14    3270
2023-08-29    3495
2023-09-13    3720
2023-09-28    3945
2023-10-13    4170
2023-10-28    4395
2023-11-12    4620
2023-11-27    4845
2023-12-12    5070
2023-12-27    5295
2024-01-11    1450
Freq: 15D, Name: Value, dtype: int64

In [217]:
index = pd.date_range('1/1/2000', periods=9, freq='min')
series = pd.Series(range(9), index=index)
#series
series.resample('3min', label='right', closed='right').sum()

2000-01-01 00:00:00     0
2000-01-01 00:03:00     6
2000-01-01 00:06:00    15
2000-01-01 00:09:00    15
Freq: 3min, dtype: int64

#### shifting

##### pandas.DataFrame.shift:
- DataFrame.shift(periods=1, freq=None, axis=0, fill_value=_NoDefault.no_default, suffix=None)

In [218]:
dates = pd.date_range(start='2023-01-01', periods=5, freq='D')
values = [10, 20, 30, 40, 50]
df = pd.DataFrame({'Value': values}, index=dates)

In [219]:
df['Value'].shift(1)

2023-01-01     NaN
2023-01-02    10.0
2023-01-03    20.0
2023-01-04    30.0
2023-01-05    40.0
Freq: D, Name: Value, dtype: float64

In [220]:
df = pd.read_csv('customer_cases.csv')
df['case_id'] = df['case_id'].shift(5)
df.head()

   Unnamed: 0 case_id            date_time customer_id channel  reason
0           1    None  2017-01-01 10:32:03       C2448   phone  signup
1           2    None  2017-01-01 11:35:47       C2449   phone  signup
2           3    None  2017-01-01 11:37:09       C2450   phone  signup
3           4    None  2017-01-01 13:28:14       C2451   phone  signup
4           5    None  2017-01-01 13:52:22       C2452   phone  signup

In [221]:
df = pd.read_csv('customer_cases.csv')

In [222]:
df.shift(1)

        Unnamed: 0   case_id            date_time customer_id channel   reason
0              NaN      None                 None        None    None     None
1              1.0     CC101  2017-01-01 10:32:03       C2448   phone   signup
2              2.0     CC102  2017-01-01 11:35:47       C2449   phone   signup
3              3.0     CC103  2017-01-01 11:37:09       C2450   phone   signup
4              4.0     CC104  2017-01-01 13:28:14       C2451   phone   signup
...            ...       ...                  ...         ...     ...      ...
330507    330507.0  CC330607  2021-12-31 19:11:01     C120740   email  support
330508    330508.0  CC330608  2021-12-31 19:16:28     C173079   email  support
330509    330509.0  CC330609  2021-12-31 19:36:42     C497581   email  support
330510    330510.0  CC330610  2021-12-31 20:30:02     C127630   email  support
330511    330511.0  CC330611  2021-12-31 21:30:00     C497538   email  support

[330512 rows x 6 columns]

In [223]:
df.shift(1, axis = 1)

        Unnamed: 0  case_id date_time          customer_id  channel reason
0              NaN        1     CC101  2017-01-01 10:32:03    C2448  phone
1              NaN        2     CC102  2017-01-01 11:35:47    C2449  phone
2              NaN        3     CC103  2017-01-01 11:37:09    C2450  phone
3              NaN        4     CC104  2017-01-01 13:28:14    C2451  phone
4              NaN        5     CC105  2017-01-01 13:52:22    C2452  phone
...            ...      ...       ...                  ...      ...    ...
330507         NaN   330508  CC330608  2021-12-31 19:16:28  C173079  email
330508         NaN   330509  CC330609  2021-12-31 19:36:42  C497581  email
330509         NaN   330510  CC330610  2021-12-31 20:30:02  C127630  email
330510         NaN   330511  CC330611  2021-12-31 21:30:00  C497538  email
330511         NaN   330512  CC330612  2022-01-01 06:32:53  C485032  phone

[330512 rows x 6 columns]

### Time-based Indexing and Slicing
Time-based Indexing and Slicing in Pandas allow you to select and manipulate data based on specific dates or time ranges

In [224]:
# Create a DataFrame with a DatetimeIndex
dates = pd.date_range(start = '2023-10-23', end =  '2024-09-30', periods = 5)
values = [10, 20, 30, 40, 50]
df = pd.DataFrame({'Value': values}, index=dates)
df
#  # Index the DataFrame using a specific date
# specific_date = pd.to_datetime('2024-02-02')
# specific_row = pd.loc[specific_date]

                     Value
2023-10-23 00:00:00     10
2024-01-16 18:00:00     20
2024-04-11 12:00:00     30
2024-07-06 06:00:00     40
2024-09-30 00:00:00     50

In [225]:
 # Index the DataFrame using a specific date
specific_date = pd.to_datetime('2024-09-30')
df.loc[specific_date]

Value    50
Name: 2024-09-30 00:00:00, dtype: int64

In [226]:
#### slicing daet ranges
dates = pd.date_range(start='2023-01-03', periods=10, freq = 'D')
values = range(10)
df = pd.DataFrame({'value':values}, index = dates)
df

            value
2023-01-03      0
2023-01-04      1
2023-01-05      2
2023-01-06      3
2023-01-07      4
2023-01-08      5
2023-01-09      6
2023-01-10      7
2023-01-11      8
2023-01-12      9

In [227]:
# # Slice the DataFrame for a specific date range
date_range = pd.date_range(start='2023-01-03', end='2023-01-06')
sliced_data = df.loc[date_range]
print(sliced_data)

            value
2023-01-03      0
2023-01-04      1
2023-01-05      2
2023-01-06      3

#### pandas timestamp now
To get the current timestamp in Pandas, you can use the pd.Timestamp.now() function. It returns the current date and time as a Pandas Timestamp object.

current_time = pd.Timestamp.now()
print(current_time)

#### pandas timestamp isoformat
The Timestamp.isoformat() method is used to return the string representation of a timestamp in ISO 8601 format. It converts a Pandas Timestamp object into a string that represents the timestamp in a standardized format.

In [228]:
ts=pd.Timestamp(year=2001,month=3,day=13,hour=4,second=30,tz='US/Eastern')
print(ts.isoformat())

2001-03-13T04:00:30-05:00

#### Pandas Timestamp.date
Timestamp.date attribute is used to extract the date component from a Pandas Timestamp object. It returns a Python datetime.date object representing the date portion of the timestamp.

In [229]:
ts=pd.Timestamp(year=2001,month=3,day=13,hour=4,second=30,tz='US/Eastern')
print(ts.date())

2001-03-13

#### Timestamp.replace() 
Timestamp.replace()method is used to create a new Timestamp object with specific components replaced. It allows you to modify individual components of a timestamp, such as the year, month, day, hour, minute, second, microsecond, or time zone.

In [230]:
ts=pd.Timestamp(year=2001,month=3,day=13,hour=4,second=30,tz='US/Eastern')
print(ts.replace(year=2023))

2023-03-13 04:00:30-04:00

#### pd.to_datetime()
function in Pandas is a powerful tool for converting various types of input into Pandas Timestamp objects. It can handle a wide range of input formats and returns a DateTime-like output.

import pandas as pd

date_list = ['2023-05-24', '2023-05-25', '2023-05-26']
timestamps = pd.to_datetime(date_list)
print(timestamps)

##  the Series.str.lower(), Series.str.upper(), and Series.str.title() 
the methods are used to transform the elements of a Series to lowercase, uppercase, and title case, respectively. These methods are particularly useful when working with string data in a Series.

In [231]:
# Series.str.lower()
import pandas as pd

data = ['Hello', 'WORLD', 'pandas']
series = pd.Series(data)
lower_series = series.str.lower()
print(lower_series)

0     hello
1     world
2    pandas
dtype: object

In [232]:
# Series.str.upper()
import pandas as pd

data = ['Hello', 'WORLD', 'pandas']
series = pd.Series(data)
upper_series = series.str.upper()
print(upper_series)

0     HELLO
1     WORLD
2    PANDAS
dtype: object

In [233]:
#Series.str.title()
import pandas as pd

data = ['hello world', 'pandas is awesome']
series = pd.Series(data)
title_series = series.str.title()
print(title_series)

0          Hello World
1    Pandas Is Awesome
dtype: object

##  Series.str.replace()
Series.str.replace() method is used to replace substrings or patterns in the elements of a Series with a specified replacement string. It allows you to perform string replacements in a flexible and efficient manner.

In [234]:
data = ['apple', 'banana', 'cherry']
series = pd.Series(data)
modified_series = series.str.replace('a', 'X')
print(modified_series)

0     Xpple
1    bXnXnX
2    cherry
dtype: object

## Series.str.strip(), lstrip() and rstrip():
the Series.str.strip(), Series.str.lstrip(), and Series.str.rstrip() methods are used to remove leading and trailing whitespace characters from the elements of a Series. These methods are useful for cleaning and preprocessing string data by eliminating unwanted whitespace.

##### Series.str.strip():
This method removes leading and trailing whitespace characters from the elements of a Series.

In [235]:
data = ['  apple  ', '  banana', 'cherry  ']
series = pd.Series(data)
stripped_series = series.str.strip()
print(stripped_series)
series

0     apple
1    banana
2    cherry
dtype: object

0      apple
1       banana
2     cherry
dtype: object

##### Series.str.lstrip(): 
This method removes leading (left) whitespace characters from the elements of a Series.

data = ['  apple  ', '  banana', 'cherry  ']
series = pd.Series(data)
lstripped_series = series.str.lstrip()
print(lstripped_series)

#### Series.str.rstrip(): 
This method removes trailing (right) whitespace characters from the elements of a Series.

In [237]:

data = ['  apple  ', '  banana', 'cherry  ']
series = pd.Series(data)
rstripped_series = series.str.rstrip()
print(rstripped_series)

0       apple
1      banana
2      cherry
dtype: object

## pd.merge
- pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)
------

In [240]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'ID': [1, 2, 4],
    'Score': [85, 90, 75]
})

pd.merge(df1, df2, on = 'ID')

   ID   Name  Score
0   1  Alice     85
1   2    Bob     90

In [242]:
pd.merge(df1, df2, on = 'ID', how = 'left')

   ID     Name  Score
0   1    Alice   85.0
1   2      Bob   90.0
2   3  Charlie    NaN

In [243]:
pd.merge(df1, df2, on = 'ID', how = 'right')

   ID   Name  Score
0   1  Alice     85
1   2    Bob     90
2   4    NaN     75

In [244]:
pd.merge(df1, df2, on = "ID", how = 'outer')

   ID     Name  Score
0   1    Alice   85.0
1   2      Bob   90.0
2   3  Charlie    NaN
3   4      NaN   75.0

### merge using different column names

### merge using different column names

In [252]:
df3 = pd.DataFrame({
    'PersonID': [1, 2, 3],
    'Age': [25, 30, 22]
})

In [253]:
merged_diff_names = pd.merge(df1, df3, left_on = 'ID', right_on = 'PersonID')
merged_diff_names

   ID     Name  PersonID  Age
0   1    Alice         1   25
1   2      Bob         2   30
2   3  Charlie         3   22